<abi-corpus architecture='elf-powerpc-64' soname='libnxz.so.0'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='adler32' type='func-type' binding='global-binding' visibility='default-visibility' alias='nx_adler32_z@@LIBNXZ_0.61.0,adler32_z@@ZLIB_1.2.9' is-defined='yes'/>
    <elf-symbol name='adler32_combine64' version='ZLIB_1.2.3.3' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='adler32_combine' version='ZLIB_1.2.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' alias='adler32_combine64@@ZLIB_1.2.3.3,nx_adler32_combine@@LIBNXZ_0.61.0' is-defined='yes'/>
    <elf-symbol name='adler32_z' version='ZLIB_1.2.9' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='compress2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='compressBound' version='ZLIB_1.2.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='crc32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='nx_deflateSetDictionary' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_deflateSetHeader' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_inflate' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_inflateCopy' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_inflateEnd' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_inflateGetHeader' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_inflateInit2_' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_inflateInit_' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_inflateReset' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_inflateResetKeep' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_inflateSetDictionary' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_inflateSyncPoint' version='LIBNXZ_0.63.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_uncompress2' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nx_uncompress' version='LIBNXZ_0.61.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uncompress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uncompress2' version='ZLIB_1.2.9' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zlibVersion' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='gzip_vas.c' language='LANG_C11'>
    <var-decl name='nx_fault_storage_address' type-id='eaa32e2f' visibility='default'/>
    <var-decl name='tb_freq' type-id='9c313c2d' visibility='default'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <type-decl name='void' id='48b5725f'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nx_adler32.c' language='LANG_C11'>
    <typedef-decl name='z_off64_t' type-id='ad707ada' id='7f907f4d'/>
    <typedef-decl name='off_t' type-id='79989e9c' id='ad707ada'/>
    <typedef-decl name='z_size_t' type-id='b59d7dce' id='2ecb4085'/>
    <function-decl name='nx_adler32_combine' mangled-name='adler32_combine' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='adler32_combine@@ZLIB_1.2.2'>
      <parameter type-id='7359adad' name='adler1'/>
      <parameter type-id='7359adad' name='adler2'/>
      <parameter type-id='7f907f4d' name='len2'/>
      <return type-id='7359adad'/>
    </function-decl>
    <function-decl name='nx_adler32' mangled-name='nx_adler32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_adler32@@LIBNXZ_0.61.0'>
      <parameter type-id='7359adad' name='adler'/>
      <parameter type-id='80f4b756' name='buf'/>
      <parameter type-id='f0981eeb' name='len'/>
      <return type-id='7359adad'/>
    </function-decl>
    <function-decl name='nx_adler32_z' mangled-name='adler32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='adler32'>
      <parameter type-id='7359adad' name='adler'/>
      <parameter type-id='80f4b756' name='buf'/>
      <parameter type-id='2ecb4085' name='len'/>
      <return type-id='7359adad'/>
    </function-decl>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <typedef-decl name='__off_t' type-id='bd54fe1a' id='79989e9c'/>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nx_compress.c' language='LANG_C11'>
    <typedef-decl name='uLongf' type-id='5bbcce85' id='4d39af59'/>
    <pointer-type-def type-id='4d39af59' size-in-bits='64' id='60db3356'/>
    <function-decl name='compressBound' mangled-name='compressBound' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='compressBound@@ZLIB_1.2.0'>
      <parameter type-id='5bbcce85' name='sourceLen'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <function-decl name='compress2' mangled-name='compress2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='compress2'>
      <parameter type-id='4c667223' name='dest'/>
      <parameter type-id='60db3356' name='destLen'/>
      <parameter type-id='e8cb3e0e' name='source'/>
      <parameter type-id='5bbcce85' name='sourceLen'/>
      <parameter type-id='95e97e5e' name='level'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='compress' mangled-name='compress' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='compress'>
      <parameter type-id='4c667223' name='dest'/>
      <parameter type-id='60db3356' name='destLen'/>
      <parameter type-id='e8cb3e0e' name='source'/>
      <parameter type-id='5bbcce85' name='sourceLen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_compressBound' mangled-name='nx_compressBound' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_compressBound@@LIBNXZ_0.61.0'>
      <parameter type-id='5bbcce85' name='sourceLen'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <function-decl name='nx_compress' mangled-name='nx_compress' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_compress@@LIBNXZ_0.61.0'>
      <parameter type-id='4c667223' name='dest'/>
      <parameter type-id='60db3356' name='destLen'/>
      <parameter type-id='e8cb3e0e' name='source'/>
      <parameter type-id='5bbcce85' name='sourceLen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_compress2' mangled-name='nx_compress2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_compress2@@LIBNXZ_0.61.0'>
      <parameter type-id='4c667223' name='dest'/>
      <parameter type-id='60db3356' name='destLen'/>
      <parameter type-id='e8cb3e0e' name='source'/>
      <parameter type-id='5bbcce85' name='sourceLen'/>
      <parameter type-id='95e97e5e' name='level'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <pointer-type-def type-id='c1606520' size-in-bits='64' id='4c667223'/>
    <pointer-type-def type-id='a6124a50' size-in-bits='64' id='e8cb3e0e'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <typedef-decl name='uLong' type-id='7359adad' id='5bbcce85'/>
    <qualified-type-def type-id='c1606520' const='yes' id='a6124a50'/>
    <typedef-decl name='Bytef' type-id='efb9ba06' id='c1606520'/>
    <typedef-decl name='Byte' type-id='002ac4a6' id='efb9ba06'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nx_crc.c' language='LANG_C11'>
    <function-decl name='crc32' mangled-name='crc32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='crc32'>
      <parameter type-id='7359adad' name='crc'/>
      <parameter type-id='354f7eb9' name='buf'/>
      <parameter type-id='09110a74' name='len'/>
      <return type-id='7359adad'/>
    </function-decl>
    <function-decl name='nx_crc32' mangled-name='nx_crc32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_crc32@@LIBNXZ_0.61.0'>
      <parameter type-id='7359adad' name='crc'/>
      <parameter type-id='354f7eb9' name='buf'/>
      <parameter type-id='9c313c2d' name='len'/>
      <return type-id='7359adad'/>
    </function-decl>
    <function-decl name='nx_crc32_combine' mangled-name='nx_crc32_combine' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_crc32_combine@@LIBNXZ_0.61.0'>
      <parameter type-id='5bbcce85' name='crc1'/>
      <parameter type-id='5bbcce85' name='crc2'/>
      <parameter type-id='9c313c2d' name='len2'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <pointer-type-def type-id='ea86de29' size-in-bits='64' id='354f7eb9'/>
    <typedef-decl name='uInt' type-id='f0981eeb' id='09110a74'/>
    <qualified-type-def type-id='002ac4a6' const='yes' id='ea86de29'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nx_deflate.c' language='LANG_C11'>
    <qualified-type-def type-id='002ac4a6' const='yes' id='ea86de29'/>
    <pointer-type-def type-id='ea86de29' size-in-bits='64' id='354f7eb9'/>
    <function-decl name='deflateCopy' mangled-name='deflateCopy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateCopy'>
      <parameter type-id='fb4f8c25' name='dest'/>
      <parameter type-id='fb4f8c25' name='source'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='deflateSetDictionary' mangled-name='deflateSetDictionary' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateSetDictionary'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='e8cb3e0e' name='dictionary'/>
      <parameter type-id='09110a74' name='dictLength'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='deflateSetHeader' mangled-name='deflateSetHeader' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateSetHeader@@ZLIB_1.2.2'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='38aaa7b9' name='head'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='deflateBound' mangled-name='deflateBound' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateBound@@ZLIB_1.2.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='7359adad' name='sourceLen'/>
      <return type-id='7359adad'/>
    </function-decl>
    <function-decl name='deflate' mangled-name='deflate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflate'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='95e97e5e' name='flush'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='deflateEnd' mangled-name='deflateEnd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateEnd'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='deflateResetKeep' mangled-name='deflateResetKeep' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateResetKeep@@ZLIB_1.2.5.2'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='deflateReset' mangled-name='deflateReset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateReset'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='deflateInit2_' mangled-name='deflateInit2_' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateInit2_'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='95e97e5e' name='level'/>
      <parameter type-id='95e97e5e' name='method'/>
      <parameter type-id='95e97e5e' name='windowBits'/>
      <parameter type-id='95e97e5e' name='memLevel'/>
      <parameter type-id='95e97e5e' name='strategy'/>
      <parameter type-id='80f4b756' name='version'/>
      <parameter type-id='95e97e5e' name='stream_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='deflateInit_' mangled-name='deflateInit_' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateInit_'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='95e97e5e' name='level'/>
      <parameter type-id='80f4b756' name='version'/>
      <parameter type-id='95e97e5e' name='stream_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_deflateCopy' mangled-name='nx_deflateCopy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_deflateCopy@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='dest'/>
      <parameter type-id='fb4f8c25' name='source'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_deflateSetDictionary' mangled-name='nx_deflateSetDictionary' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_deflateSetDictionary@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='354f7eb9' name='dictionary'/>
      <parameter type-id='f0981eeb' name='dictLength'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_deflateSetHeader' mangled-name='nx_deflateSetHeader' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_deflateSetHeader@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='38aaa7b9' name='head'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_deflateBound' mangled-name='nx_deflateBound' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_deflateBound@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='7359adad' name='sourceLen'/>
      <return type-id='7359adad'/>
    </function-decl>
    <function-decl name='nx_deflate' mangled-name='nx_deflate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_deflate@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='95e97e5e' name='flush'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_deflateInit2_' mangled-name='nx_deflateInit2_' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_deflateInit2_@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='95e97e5e' name='level'/>
      <parameter type-id='95e97e5e' name='method'/>
      <parameter type-id='95e97e5e' name='windowBits'/>
      <parameter type-id='95e97e5e' name='memLevel'/>
      <parameter type-id='95e97e5e' name='strategy'/>
      <parameter type-id='80f4b756' name='version'/>
      <parameter type-id='95e97e5e' name='stream_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_deflateInit_' mangled-name='nx_deflateInit_' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_deflateInit_@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='95e97e5e' name='level'/>
      <parameter type-id='80f4b756' name='version'/>
      <parameter type-id='95e97e5e' name='stream_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_deflateEnd' mangled-name='nx_deflateEnd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_deflateEnd@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_deflateReset' mangled-name='nx_deflateReset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_deflateReset@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <typedef-decl name='gz_headerp' type-id='a0c92bba' id='38aaa7b9'/>
    <typedef-decl name='z_streamp' type-id='369435a4' id='fb4f8c25'/>
    <pointer-type-def type-id='259cb173' size-in-bits='64' id='a0c92bba'/>
    <pointer-type-def type-id='59efae17' size-in-bits='64' id='369435a4'/>
    <typedef-decl name='gz_header' type-id='05dd269e' id='259cb173'/>
    <typedef-decl name='z_stream' type-id='d19a2f20' id='59efae17'/>
    <class-decl name='gz_header_s' size-in-bits='640' is-struct='yes' visibility='default' id='05dd269e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='text' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='time' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xflags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='os' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='extra' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='extra_len' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='extra_max' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='name_max' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='comment' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='comm_max' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='hcrc' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='done' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='z_stream_s' size-in-bits='896' is-struct='yes' visibility='default' id='d19a2f20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next_in' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avail_in' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='total_in' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next_out' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avail_out' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='total_out' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='msg' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='state' type-id='3a49ee4c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zalloc' type-id='b6ee541c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='zfree' type-id='ee14d515' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='opaque' type-id='ba959244' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='data_type' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='adler' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='reserved' type-id='5bbcce85' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <pointer-type-def type-id='221461a6' size-in-bits='64' id='3a49ee4c'/>
    <typedef-decl name='alloc_func' type-id='9e12fab2' id='b6ee541c'/>
    <typedef-decl name='free_func' type-id='0a71128c' id='ee14d515'/>
    <typedef-decl name='voidpf' type-id='eaa32e2f' id='ba959244'/>
    <class-decl name='internal_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='221461a6'/>
    <pointer-type-def type-id='3bf9d798' size-in-bits='64' id='9e12fab2'/>
    <pointer-type-def type-id='e9af568a' size-in-bits='64' id='0a71128c'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nx_inflate.c' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <class-decl name='internal_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='221461a6'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='void' id='48b5725f'/>
    <typedef-decl name='z_streamp' type-id='369435a4' id='fb4f8c25'/>
    <typedef-decl name='z_stream' type-id='d19a2f20' id='59efae17'/>
    <class-decl name='z_stream_s' size-in-bits='896' is-struct='yes' visibility='default' id='d19a2f20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next_in' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avail_in' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='total_in' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next_out' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avail_out' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='total_out' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='msg' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='state' type-id='3a49ee4c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zalloc' type-id='b6ee541c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='zfree' type-id='ee14d515' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='opaque' type-id='ba959244' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='data_type' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='adler' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='reserved' type-id='5bbcce85' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Bytef' type-id='efb9ba06' id='c1606520'/>
    <typedef-decl name='Byte' type-id='002ac4a6' id='efb9ba06'/>
    <typedef-decl name='uInt' type-id='f0981eeb' id='09110a74'/>
    <typedef-decl name='uLong' type-id='7359adad' id='5bbcce85'/>
    <typedef-decl name='alloc_func' type-id='9e12fab2' id='b6ee541c'/>
    <typedef-decl name='voidpf' type-id='eaa32e2f' id='ba959244'/>
    <typedef-decl name='free_func' type-id='0a71128c' id='ee14d515'/>
    <typedef-decl name='gz_headerp' type-id='a0c92bba' id='38aaa7b9'/>
    <typedef-decl name='gz_header' type-id='05dd269e' id='259cb173'/>
    <class-decl name='gz_header_s' size-in-bits='640' is-struct='yes' visibility='default' id='05dd269e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='text' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='time' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xflags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='os' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='extra' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='extra_len' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='extra_max' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='name_max' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='comment' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='comm_max' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='hcrc' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='done' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c1606520' size-in-bits='64' id='4c667223'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='c1606520' const='yes' id='a6124a50'/>
    <pointer-type-def type-id='a6124a50' size-in-bits='64' id='e8cb3e0e'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='259cb173' size-in-bits='64' id='a0c92bba'/>
    <pointer-type-def type-id='221461a6' size-in-bits='64' id='3a49ee4c'/>
    <pointer-type-def type-id='3bf9d798' size-in-bits='64' id='9e12fab2'/>
    <pointer-type-def type-id='e9af568a' size-in-bits='64' id='0a71128c'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='59efae17' size-in-bits='64' id='369435a4'/>
    <function-decl name='inflateSyncPoint' mangled-name='inflateSyncPoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateSyncPoint'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inflateGetHeader' mangled-name='inflateGetHeader' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateGetHeader@@ZLIB_1.2.2'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='38aaa7b9' name='head'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inflateCopy' mangled-name='inflateCopy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateCopy@@ZLIB_1.2.0'>
      <parameter type-id='fb4f8c25' name='dest'/>
      <parameter type-id='fb4f8c25' name='source'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inflateSetDictionary' mangled-name='inflateSetDictionary' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateSetDictionary'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='e8cb3e0e' name='dictionary'/>
      <parameter type-id='09110a74' name='dictLength'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inflate' mangled-name='inflate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflate'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='95e97e5e' name='flush'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inflateEnd' mangled-name='inflateEnd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateEnd'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inflateResetKeep' mangled-name='inflateResetKeep' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateResetKeep@@ZLIB_1.2.5.2'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inflateReset2' mangled-name='inflateReset2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateReset2@@ZLIB_1.2.3.4'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='95e97e5e' name='windowBits'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inflateReset' mangled-name='inflateReset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateReset'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inflateInit_' mangled-name='inflateInit_' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateInit_'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='80f4b756' name='version'/>
      <parameter type-id='95e97e5e' name='stream_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_inflateSyncPoint' mangled-name='nx_inflateSyncPoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_inflateSyncPoint@@LIBNXZ_0.63.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_inflateGetHeader' mangled-name='nx_inflateGetHeader' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_inflateGetHeader@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='38aaa7b9' name='head'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_inflateCopy' mangled-name='nx_inflateCopy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_inflateCopy@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='dest'/>
      <parameter type-id='fb4f8c25' name='source'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_inflateSetDictionary' mangled-name='nx_inflateSetDictionary' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_inflateSetDictionary@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='e8cb3e0e' name='dictionary'/>
      <parameter type-id='09110a74' name='dictLength'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_inflate' mangled-name='nx_inflate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_inflate@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='95e97e5e' name='flush'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_inflateEnd' mangled-name='nx_inflateEnd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_inflateEnd@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_inflateInit_' mangled-name='nx_inflateInit_' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_inflateInit_@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='80f4b756' name='version'/>
      <parameter type-id='95e97e5e' name='stream_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_inflateInit2_' mangled-name='nx_inflateInit2_' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_inflateInit2_@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='95e97e5e' name='windowBits'/>
      <parameter type-id='80f4b756' name='version'/>
      <parameter type-id='95e97e5e' name='stream_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_inflateReset' mangled-name='nx_inflateReset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_inflateReset@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_inflateResetKeep' mangled-name='nx_inflateResetKeep' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_inflateResetKeep@@LIBNXZ_0.61.0'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inflateInit2_' mangled-name='inflateInit2_' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateInit2_'>
      <parameter type-id='fb4f8c25' name='strm'/>
      <parameter type-id='95e97e5e' name='windowBits'/>
      <parameter type-id='80f4b756' name='version'/>
      <parameter type-id='95e97e5e' name='stream_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='3bf9d798'>
      <parameter type-id='ba959244'/>
      <parameter type-id='09110a74'/>
      <parameter type-id='09110a74'/>
      <return type-id='ba959244'/>
    </function-type>
    <function-type size-in-bits='64' id='e9af568a'>
      <parameter type-id='ba959244'/>
      <parameter type-id='ba959244'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nx_uncompr.c' language='LANG_C11'>
    <pointer-type-def type-id='5bbcce85' size-in-bits='64' id='b0c2822c'/>
    <function-decl name='uncompress' mangled-name='uncompress' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uncompress'>
      <parameter type-id='4c667223' name='dest'/>
      <parameter type-id='60db3356' name='destLen'/>
      <parameter type-id='e8cb3e0e' name='source'/>
      <parameter type-id='5bbcce85' name='sourceLen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='uncompress2' mangled-name='uncompress2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uncompress2@@ZLIB_1.2.9'>
      <parameter type-id='4c667223' name='dest'/>
      <parameter type-id='60db3356' name='destLen'/>
      <parameter type-id='e8cb3e0e' name='source'/>
      <parameter type-id='b0c2822c' name='sourceLen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_uncompress' mangled-name='nx_uncompress' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_uncompress@@LIBNXZ_0.61.0'>
      <parameter type-id='4c667223' name='dest'/>
      <parameter type-id='60db3356' name='destLen'/>
      <parameter type-id='e8cb3e0e' name='source'/>
      <parameter type-id='5bbcce85' name='sourceLen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nx_uncompress2' mangled-name='nx_uncompress2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nx_uncompress2@@LIBNXZ_0.61.0'>
      <parameter type-id='4c667223' name='dest'/>
      <parameter type-id='60db3356' name='destLen'/>
      <parameter type-id='e8cb3e0e' name='source'/>
      <parameter type-id='b0c2822c' name='sourceLen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nx_zlib.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='7359adad' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='16384' id='d362a102'>
      <subrange length='256' type-id='7359adad' id='36e5b9fa'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <class-decl name='nx_config_t' size-in-bits='768' is-struct='yes' visibility='default' id='2c339f29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='page_sz' type-id='bd54fe1a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line_sz' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='stored_block_len' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_byte_count_low' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='max_byte_count_high' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='max_byte_count_current' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='max_source_dde_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='max_target_dde_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='max_vas_reuse_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='per_job_len' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='strm_def_bufsz' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='soft_copy_threshold' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cache_threshold' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='deflate_fifo_in_len' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='deflate_fifo_out_len' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='window_max' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='timeout_pgfaults' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='verbose' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='mlock_nx_crb_csb' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dht' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='nx_ratio' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='strategy_override' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='gzip_selector' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='FILE' type-id='ec1ed955' id='aa12d1ba'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='8efea9e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='bd54fe1a' id='79989e9c'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='bd54fe1a' id='724e4de6'/>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <typedef-decl name='pthread_mutex_t' type-id='c4794498' id='7a6844eb'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' id='c4794498'>
      <data-member access='private'>
        <var-decl name='__data' type-id='4c734837' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='36c46961' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' id='518fb49c'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='zlib_stats' size-in-bits='133056' is-struct='yes' visibility='default' id='3c1bf0d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='deflateInit' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='deflate' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='deflate_sw' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='deflate_nx' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='deflate_avail_in' type-id='d362a102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16640'>
        <var-decl name='deflate_avail_out' type-id='d362a102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='deflateReset' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='deflate_total_in' type-id='d362a102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49472'>
        <var-decl name='deflate_total_out' type-id='d362a102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='65856'>
        <var-decl name='deflateSetDictionary' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='65920'>
        <var-decl name='deflateSetHeader' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='65984'>
        <var-decl name='deflateParams' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66048'>
        <var-decl name='deflateBound' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66112'>
        <var-decl name='deflatePrime' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66176'>
        <var-decl name='deflateCopy' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66240'>
        <var-decl name='deflateEnd' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66304'>
        <var-decl name='compress' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66368'>
        <var-decl name='inflateInit' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66432'>
        <var-decl name='inflate' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66496'>
        <var-decl name='inflate_sw' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66560'>
        <var-decl name='inflate_nx' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66624'>
        <var-decl name='inflate_avail_in' type-id='d362a102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='83008'>
        <var-decl name='inflate_avail_out' type-id='d362a102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='99392'>
        <var-decl name='inflateReset' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='99456'>
        <var-decl name='inflateReset2' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='99520'>
        <var-decl name='inflate_total_in' type-id='d362a102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='115904'>
        <var-decl name='inflate_total_out' type-id='d362a102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132288'>
        <var-decl name='inflateSetDictionary' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132352'>
        <var-decl name='inflateGetDictionary' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132416'>
        <var-decl name='inflateGetHeader' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132480'>
        <var-decl name='inflateSync' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132544'>
        <var-decl name='inflatePrime' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132608'>
        <var-decl name='inflateCopy' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132672'>
        <var-decl name='inflateEnd' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132736'>
        <var-decl name='uncompress' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132800'>
        <var-decl name='deflate_len' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132864'>
        <var-decl name='deflate_time' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132928'>
        <var-decl name='inflate_len' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132992'>
        <var-decl name='inflate_time' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <var-decl name='nx_config' type-id='2c339f29' visibility='default'/>
    <var-decl name='nx_dbg' type-id='95e97e5e' visibility='default'/>
    <var-decl name='nx_gzip_trace' type-id='95e97e5e' visibility='default'/>
    <var-decl name='nx_gzip_log' type-id='822cd80b' visibility='default'/>
    <var-decl name='mutex_log' type-id='7a6844eb' visibility='default'/>
    <var-decl name='zlib_stats_mutex' type-id='7a6844eb' visibility='default'/>
    <var-decl name='zlib_stats' type-id='3c1bf0d8' visibility='default'/>
    <function-decl name='zlibVersion' mangled-name='zlibVersion' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zlibVersion'>
      <return type-id='80f4b756'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
